model {
  center_net {
    num_classes: 1
    feature_extractor {
      type: "hourglass_104"
      channel_means: 104.01361846923828
      channel_means: 114.03422546386719
      channel_means: 119.91659545898438
      channel_stds: 73.60276794433594
      channel_stds: 69.89082336425781
      channel_stds: 70.91507720947266
      bgr_ordering: true
    }
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 768
        max_dimension: 512
        pad_to_max_dimension: true
      }
    }
    object_detection_task {
      task_loss_weight: 1.0
      offset_loss_weight: 1.0
      scale_loss_weight: 0.10000000149011612
      localization_loss {
        l1_localization_loss {
        }
      }
    }
    object_center_params {
      object_center_loss_weight: 1.0
      classification_loss {
        penalty_reduced_logistic_focal_loss {
          alpha: 2.0
          beta: 4.0
        }
      }
      min_box_overlap_iou: 0.699999988079071
      max_box_predictions: 100
    }
  }
}
train_config {
  batch_size: 1
  data_augmentation_options {
    random_horizontal_flip {}
    random_adjust_hue {}
    random_adjust_contrast {}
    random_adjust_saturation {}
    random_adjust_brightness {}
  }
  optimizer {
    adam_optimizer {
      learning_rate {
        manual_step_learning_rate {
          initial_learning_rate: 0.0025
          schedule {
            step: 50000
            learning_rate: 2.5e-4
          }
          schedule {
            step: 80000
            learning_rate: 2.5e-5
          }
        }
      }
      epsilon: 1.0000000116860974e-07
    }
    use_moving_average: false
  }
  fine_tune_checkpoint: "/home/plome/models/research/object_detection/pre_trained_models/centernet_hg104_512x512_coco17_tpu-8/checkpoint/ckpt-0"
  num_steps: 40000
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
  fine_tune_checkpoint_type: "detection"
  fine_tune_checkpoint_version: V2
  run_fine_tune_checkpoint_dummy_computation: false
}
train_input_reader {
  label_map_path: "/home/plome/DATA/INVHALI/sets/object/mix/data_resized_800_600/label_map.pbtxt"
  tf_record_input_reader {
    input_path: "/home/plome/DATA/INVHALI/sets/object/mix/data_resized_800_600/train.record"
  }
}

eval_config {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  num_examples: 29
  num_visualizations: 29
  visualize_groundtruth_boxes: true
  batch_size: 1
}

eval_input_reader {
  label_map_path: "/home/plome/DATA/INVHALI/sets/object/mix/data_resized_800_600/label_map.pbtxt"
  shuffle: false
  num_epochs: 1
  tf_record_input_reader {
    input_path: "/home/plome/DATA/INVHALI/sets/object/mix/data_resized_800_600/test.record"
  }
}
